/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   test_bit.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yshimoma <yshimoma@student.42tokyo.jp>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/03/04 15:12:27 by yshimoma          #+#    #+#             */
/*   Updated: 2023/03/04 17:55:14 by yshimoma         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

/*
なぜ1 << iから始める？
なぜ&で計算する？
なぜx >> iで格納する？
*/

// 2進数表示用の関数
void	printBi(int num)
{
	int	len = 8;
	int	bit[8];
	int	x;

	/*
	1回目
	00000001 = 00000001 << 0
	00000000 = 11111110 && 00000001
	00000000 = 00000000 >> 0
	bit[7] = 0

	2回目
	00000010 = 00000001 << 1
	00000010 = 11111110 && 00000010
	00000001 = 00000010 >> 1
	bit[6] = 1

	3回目
	00000100 = 00000001 << 2
	00000100 = 11111110 && 00000100
	00000001 = 00000100 >> 2
	bit[5] = 1
	------------------------------------------
	1回目
	00000001 = 00000001 << 0
	00000000 = 00000100 && 00000001
	00000000 = 00000000 >> 0
	bit[7] = 0

	2回目
	00000010 = 00000001 << 1
	00000000 = 00000100 && 00000010
	00000000 = 00000000 >> 1
	bit[6] = 0

	3回目
	00000100 = 00000001 << 2
	00000100 = 00000100 && 00000100
	00000001 = 00000100 >> 2
	bit[5] = 1
	4回目
	00001000 = 00000001 << 3
	00000000 = 00000100 && 00001000
	00000000 = 00000000 >> 3
	bit[6] = 0

	10110110
	00000001
	00000010
	00000100
	00001000

	10110110
	*/
	for (int i = 0; i < len; i++) {
		x = 1 << i;//iの数だけ1をシフトするため1で固定
		x = num & x;
		bit[len - i - 1] = x >> i;
	}
	// printf("0b");
	for(int i = 0; i < len; i++) {
		printf("%d", bit[i]);
	}
}
 
int main(void) {
	// int	num1, num2, result;

	// num1 = 0b0101;
	// num2 = 0b0011;
	// result = num1 & num2;
	int result = 254;
	
	// 演算結果を2進数と10進数で表示
	printf("2進数:");
	printBi(result);
	printf("\n(10進数:%d)\n", result);
	return 0;
}

/*
ビットのシフト演算

演算子		意味				例
<<		ビットを左にシフトする	x << 1 （変数xの値を左に1ビットシフト）
>>		ビットを右にシフトする	x >> 1 （変数xの値を右に1ビットシフト）

実行結果：
 100 [16進数   64]を左へ1ビットシフトすると  200 [16進数   c8]
 100 [16進数   64]を右へ1ビットシフトすると   50 [16進数   32]
*/
// int	main(void)
// {
//	 unsigned short x,y,z;
//	 x = 100;
	
//	 y = x << 1;
//	 z = x >> 1;
	
//	 printf("%5d [16進数 %4x]を左へ1ビットシフトすると%5d [16進数 %4x]\n",x,x,y,y);
//	 printf("%5d [16進数 %4x]を右へ1ビットシフトすると%5d [16進数 %4x]\n",x,x,z,z);

//	 return 0;
// }

/*
ビットごとの論理演算
変数a,bを2進数で表すと次のようになります。

a = 0000 0000 1111 1111
b = 1010 1010 1010 1010
※わかりやすように4桁ごとに区切ってあります。

演算子	意味
＆		ビットごとのAND演算
|		ビットごとのOR演算
^		ビットごとのXOR演算
~		ビットごとのNOT演算
*/
// int	main(void)
// {
// 	unsigned short a,b;
// 	unsigned short w,x,y,z,v;

// 	a = 0x00FF;
// 	b = 0xAAAA;
// 	w = a & b;
// 	x = a | b;
// 	y = a ^ b;
// 	v = ~ a;
// 	z = ~ b;

// 	printf("%4X AND %4X = %4X\n", a, b, w);
// 	printf("%4X OR %4X = %4X\n", a, b, x);
// 	printf("%4X XOR %4X = %4X\n", a, b, y);
// 	printf(" NOT %4X = %4X\n", a, v);
// 	printf(" NOT %4X = %4X\n", b, z);
// 	return (0);
// }

